[NoCoverage] BlockStatement
src/budget/budget.adapter.service.ts:16:43
     @InjectRepository(Budget) private budgetRepsoitory: Repository<Budget>,
   ) {}
 
-  create(entityLike: DeepPartial<Budget>) {
-    return this.budgetRepsoitory.create(entityLike);
-  }
+  create(entityLike: DeepPartial<Budget>) {}
 
   async findBy(where: FindOptionsWhere<Budget> | FindOptionsWhere<Budget>[]) {

[NoCoverage] BlockStatement
src/budget/budget.adapter.service.ts:20:78
     return this.budgetRepsoitory.create(entityLike);
   }
 
-  async findBy(where: FindOptionsWhere<Budget> | FindOptionsWhere<Budget>[]) {
-    return await this.budgetRepsoitory.findBy(where);
-  }
+  async findBy(where: FindOptionsWhere<Budget> | FindOptionsWhere<Budget>[]) {}
 
   async findAll(options?: FindManyOptions<Budget>) {

[NoCoverage] BlockStatement
src/budget/budget.adapter.service.ts:24:52
     return await this.budgetRepsoitory.findBy(where);
   }
 
-  async findAll(options?: FindManyOptions<Budget>) {
-    return await this.budgetRepsoitory.find(options);
-  }
+  async findAll(options?: FindManyOptions<Budget>) {}
 
   createQueryBuilder(alias?: string, queryRunner?: QueryRunner) {

[NoCoverage] BlockStatement
src/budget/budget.adapter.service.ts:28:65
     return await this.budgetRepsoitory.find(options);
   }
 
-  createQueryBuilder(alias?: string, queryRunner?: QueryRunner) {
-    return this.budgetRepsoitory.createQueryBuilder(alias, queryRunner);
-  }
+  createQueryBuilder(alias?: string, queryRunner?: QueryRunner) {}
 }
 
