[NoCoverage] BlockStatement
src/budget/dto/create-budget.dto.ts:18:29
   @MaxLength(30)
   private _name: string;
 
-  public get name(): string {
-    return this._name;
-  }
+  public get name(): string {}
   public set name(value: string) {
     this._name = value;

[Survived] BlockStatement
src/budget/dto/create-budget.dto.ts:21:34
   public get name(): string {
     return this._name;
   }
-  public set name(value: string) {
-    this._name = value;
-  }
+  public set name(value: string) {}
 
   @IsNotEmpty()

[NoCoverage] BlockStatement
src/budget/dto/create-budget.dto.ts:31:36
   @MaxLength(250)
   private _description: string;
 
-  public get description(): string {
-    return this._description;
-  }
+  public get description(): string {}
   public set description(value: string) {
     this._description = value;

[Survived] BlockStatement
src/budget/dto/create-budget.dto.ts:34:41
   public get description(): string {
     return this._description;
   }
-  public set description(value: string) {
-    this._description = value;
-  }
+  public set description(value: string) {}
 
   @IsNotEmpty()

[NoCoverage] BlockStatement
src/budget/dto/create-budget.dto.ts:45:29
   @Max(9999)
   private _year: number;
 
-  public get year(): number {
-    return this._year;
-  }
+  public get year(): number {}
   public set year(value: number) {
     this._year = value;

[Survived] BlockStatement
src/budget/dto/create-budget.dto.ts:48:34
   public get year(): number {
     return this._year;
   }
-  public set year(value: number) {
-    this._year = value;
-  }
+  public set year(value: number) {}
 }
 
