[NoCoverage] BlockStatement
src/budget/dto/get-budgets-filter.dto.ts:7:31
   @MaxLength(250)
   private _search: string;
 
-  public get search(): string {
-    return this._search;
-  }
+  public get search(): string {}
   public set search(value: string) {
     this._search = value;

[NoCoverage] BlockStatement
src/budget/dto/get-budgets-filter.dto.ts:10:36
   public get search(): string {
     return this._search;
   }
-  public set search(value: string) {
-    this._search = value;
-  }
+  public set search(value: string) {}
 }
 
