[Killed] BlockStatement
src/budget/budget.controller.ts:19:52
   constructor(private budgetService: BudgetService) {}
 
   @Post()
-  createBudget(@Body() budgetDto: CreateBudgetDto) {
-    return this.budgetService.createBudget(budgetDto);
-  }
+  createBudget(@Body() budgetDto: CreateBudgetDto) {}
 
   @Get()
killedBy: BudgetController should create a budget
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2022 budget", "id": Any<String>, "name": "2022 Budget", "year": 2022}
Received: undefined

[Killed] BlockStatement
src/budget/budget.controller.ts:24:19
   }
 
   @Get()
-  getAllBudgets() {
-    return this.budgetService.getAllBudgets();
-  }
+  getAllBudgets() {}
 
   @Get(':id')
killedBy: BudgetController should get all budgets
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"description": "This is the 2022 budget", "id": Any<String>, "name": "2022 Budget", "year": 2022}]
Received: undefined

[Killed] BlockStatement
src/budget/budget.controller.ts:29:42
   }
 
   @Get(':id')
-  getBudgetByID(@Param('id') id: string) {
-    return this.budgetService.findBudgetById(id);
-  }
+  getBudgetByID(@Param('id') id: string) {}
 
   @Patch(':id')
killedBy: BudgetController should get a budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2022 budget", "id": Any<String>, "name": "2022 Budget", "year": 2022}
Received: undefined

[Killed] BlockStatement
src/budget/budget.controller.ts:37:5
   updateBudget(
     @Param('id') id: string,
     @Body() updateBudgetDto: UpdateBudgetDto,
-  ) {
-    return this.budgetService.updateBudgetById(id, updateBudgetDto);
-  }
+  ) {}
 
   @Delete(':id')
killedBy: BudgetController should update a budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "This is the 2023 budget",
+   "description": "This is the 2022 budget",

[Killed] BlockStatement
src/budget/budget.controller.ts:42:45
   }
 
   @Delete(':id')
-  deleteBudgetById(@Param('id') id: string) {
-    return this.budgetService.deleteBudgetById(id);
-  }
+  deleteBudgetById(@Param('id') id: string) {}
 }
 
killedBy: BudgetController should delete a budget by ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The budget with ID: e568d65b-e069-4f35-8e63-b7155a0b4272 cannot be found"

Received function did not throw
