[Killed] BlockStatement
src/budget/budget.repository.ts:12:50
     private budgetRepositoryAdapterService: BudgetRepositoryAdapterService,
   ) {}
 
-  createBudget(createBudgetDto: CreateBudgetDto) {
-    const { name, description, year } = createBudgetDto;
-    const createdBudget = this.budgetRepositoryAdapterService.create({
-      name,
-      description,
-      year,
-    });
-    return createdBudget;
-  }
+  createBudget(createBudgetDto: CreateBudgetDto) {}
 
   async findById(id: string) {
killedBy: BudgetRepository should create a budget
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2023 budget", "id": Any<String>, "name": "2023 Budget", "year": 2023}
Received: undefined

[Killed] BlockStatement
src/budget/budget.repository.ts:22:30
     return createdBudget;
   }
 
-  async findById(id: string) {
-    if (id === '1')
-      return await this.budgetRepositoryAdapterService.findBy({ id });
-  }
+  async findById(id: string) {}
 
   async findAll(filterDto?: GetBudgetsFilterDto) {
killedBy: BudgetRepository should get budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2023 budget", "id": "1", "name": "2023 Budget", "year": 2023}
Received: undefined

[Killed] ConditionalExpression
src/budget/budget.repository.ts:23:9
   }
 
   async findById(id: string) {
-    if (id === '1')
+    if (false)
       return await this.budgetRepositoryAdapterService.findBy({ id });
   }
killedBy: BudgetRepository should get budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2023 budget", "id": "1", "name": "2023 Budget", "year": 2023}
Received: undefined

[Killed] EqualityOperator
src/budget/budget.repository.ts:23:9
   }
 
   async findById(id: string) {
-    if (id === '1')
+    if (id !== '1')
       return await this.budgetRepositoryAdapterService.findBy({ id });
   }
killedBy: BudgetRepository should get budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2023 budget", "id": "1", "name": "2023 Budget", "year": 2023}
Received: undefined

[Killed] ConditionalExpression
src/budget/budget.repository.ts:28:9
   }
 
   async findAll(filterDto?: GetBudgetsFilterDto) {
-    if (!filterDto) return await this.budgetRepositoryAdapterService.findAll();
+    if (true) return await this.budgetRepositoryAdapterService.findAll();
     const { search } = filterDto;
 
killedBy: BudgetRepository should get all budgets by search criteria
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/budget/budget.repository.ts:28:9
   }
 
   async findAll(filterDto?: GetBudgetsFilterDto) {
-    if (!filterDto) return await this.budgetRepositoryAdapterService.findAll();
+    if (filterDto) return await this.budgetRepositoryAdapterService.findAll();
     const { search } = filterDto;
 
killedBy: BudgetRepository should get all budgets
statusReason: TypeError: Cannot destructure property 'search' of 'filterDto' as it is undefined.

[Killed] StringLiteral
src/budget/budget.repository.ts:32:62
     const { search } = filterDto;
 
     const query =
-      this.budgetRepositoryAdapterService.createQueryBuilder('budget');
+      this.budgetRepositoryAdapterService.createQueryBuilder("");
 
     query
killedBy: BudgetRepository should get all budgets by search criteria
statusReason: Error: expect(createQueryBuilder).toHaveBeenCalledWith(...expected)

Expected: "budget"
Received: ""

Number of calls: 1

[Survived] StringLiteral
src/budget/budget.repository.ts:35:14
       this.budgetRepositoryAdapterService.createQueryBuilder('budget');
 
     query
-      .where('(LOWER(budget.id) LIKE LOWER(:search)', { search: `%${search}%` })
+      .where("", { search: `%${search}%` })
       .orWhere('LOWER(budget.name) LIKE LOWER(:search)', {
         search: `%${search}%`,

[Survived] ObjectLiteral
src/budget/budget.repository.ts:36:58
 
     query
       .where('(LOWER(budget.id) LIKE LOWER(:search)', { search: `%${search}%` })
-      .orWhere('LOWER(budget.name) LIKE LOWER(:search)', {
-        search: `%${search}%`,
-      })
+      .orWhere('LOWER(budget.name) LIKE LOWER(:search)', {})
       .orWhere('LOWER(budget.description) LIKE LOWER(:search)', {
         search: `%${search}%`,

[Survived] StringLiteral
src/budget/budget.repository.ts:37:17
     query
       .where('(LOWER(budget.id) LIKE LOWER(:search)', { search: `%${search}%` })
       .orWhere('LOWER(budget.name) LIKE LOWER(:search)', {
-        search: `%${search}%`,
+        search: ``,
       })
       .orWhere('LOWER(budget.description) LIKE LOWER(:search)', {
