[Killed] ArrayDeclaration
src/budget/budget.service.ts:9:31
 
 @Injectable()
 export class BudgetService {
-  private budgets: Budget[] = [];
+  private budgets: Budget[] = ["Stryker was here"];
 
   getAllBudgets() {
killedBy: BudgetController should get all budgets
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Array [
+   "Stryker was here",
    Object {

[Killed] BlockStatement
src/budget/budget.service.ts:11:19
 export class BudgetService {
   private budgets: Budget[] = [];
 
-  getAllBudgets() {
-    return this.budgets;
-  }
+  getAllBudgets() {}
 
   set setBudgets(budgets: Budget[]) {
killedBy: BudgetController should get all budgets
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"description": "This is the 2022 budget", "id": Any<String>, "name": "2022 Budget", "year": 2022}]
Received: undefined

[Killed] BlockStatement
src/budget/budget.service.ts:15:37
     return this.budgets;
   }
 
-  set setBudgets(budgets: Budget[]) {
-    this.budgets = budgets;
-  }
+  set setBudgets(budgets: Budget[]) {}
 
   findBudgetById(id: string) {
killedBy: BudgetService should get a budget by ID
statusReason: NotFoundException: The budget with ID: 1 cannot be found

[Killed] BlockStatement
src/budget/budget.service.ts:19:30
     this.budgets = budgets;
   }
 
-  findBudgetById(id: string) {
-    const budgetFound = this.budgets.find(
-      (currentBudget) => currentBudget.id === id,
-    );
-    if (!budgetFound)
-      throw new NotFoundException(`The budget with ID: ${id} cannot be found`);
-    return budgetFound;
-  }
+  findBudgetById(id: string) {}
 
   createBudget(budgetDto: CreateBudgetDto) {
killedBy: BudgetController should get a budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2022 budget", "id": Any<String>, "name": "2022 Budget", "year": 2022}
Received: undefined

[Killed] ArrowFunction
src/budget/budget.service.ts:21:7
 
   findBudgetById(id: string) {
     const budgetFound = this.budgets.find(
-      (currentBudget) => currentBudget.id === id,
+      () => undefined,
     );
     if (!budgetFound)
killedBy: BudgetController should get a budget by ID
statusReason: NotFoundException: The budget with ID: 9026aebc-26a9-4d6a-b3c2-11b3b41769a2 cannot be found

[Killed] EqualityOperator
src/budget/budget.service.ts:21:26
 
   findBudgetById(id: string) {
     const budgetFound = this.budgets.find(
-      (currentBudget) => currentBudget.id === id,
+      (currentBudget) => currentBudget.id !== id,
     );
     if (!budgetFound)
killedBy: BudgetController should get a budget by ID
statusReason: NotFoundException: The budget with ID: 4e08e905-f59f-456b-a7fd-81edb9e62b58 cannot be found

[Killed] BooleanLiteral
src/budget/budget.service.ts:23:9
     const budgetFound = this.budgets.find(
       (currentBudget) => currentBudget.id === id,
     );
-    if (!budgetFound)
+    if (budgetFound)
       throw new NotFoundException(`The budget with ID: ${id} cannot be found`);
     return budgetFound;
killedBy: BudgetController should get a budget by ID
statusReason: NotFoundException: The budget with ID: 7484952d-c0ad-4018-a200-edc61b3926b7 cannot be found

[Killed] ConditionalExpression
src/budget/budget.service.ts:23:9
     const budgetFound = this.budgets.find(
       (currentBudget) => currentBudget.id === id,
     );
-    if (!budgetFound)
+    if (false)
       throw new NotFoundException(`The budget with ID: ${id} cannot be found`);
     return budgetFound;
killedBy: BudgetController should throw not found for budget that does not exist by ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The budget with ID: 1 cannot be found"

Received function did not throw

[Killed] BlockStatement
src/budget/budget.service.ts:28:44
     return budgetFound;
   }
 
-  createBudget(budgetDto: CreateBudgetDto) {
-    const { name, description, year } = budgetDto;
-    const budget: Budget = {
-      id: randomUUID(),
-      name,
-      description,
-      year,
-    };
-    this.budgets.push(budget);
-    return budget;
-  }
+  createBudget(budgetDto: CreateBudgetDto) {}
 
   updateBudgetById(id: string, updateBudgetDto: UpdateBudgetDto) {
killedBy: BudgetController should create a budget
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "This is the 2022 budget", "id": Any<String>, "name": "2022 Budget", "year": 2022}
Received: undefined

[Killed] BlockStatement
src/budget/budget.service.ts:40:66
     return budget;
   }
 
-  updateBudgetById(id: string, updateBudgetDto: UpdateBudgetDto) {
-    const { description, name, year } = updateBudgetDto;
-    const budgetToUpdate = this.findBudgetById(id);
-    budgetToUpdate.description = description;
-    budgetToUpdate.name = name;
-    budgetToUpdate.year = year;
-    return budgetToUpdate;
-  }
+  updateBudgetById(id: string, updateBudgetDto: UpdateBudgetDto) {}
 
   deleteBudgetById(id: string) {
killedBy: BudgetController should update a budget by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "description": "This is the 2023 budget",
+   "description": "This is the 2022 budget",

[Killed] BlockStatement
src/budget/budget.service.ts:49:32
     return budgetToUpdate;
   }
 
-  deleteBudgetById(id: string) {
-    const budgetToDelete = this.findBudgetById(id);
-    const newBudgets = this.budgets.filter(
-      (budget) => budget.id !== budgetToDelete.id,
-    );
-    this.budgets = newBudgets;
-  }
+  deleteBudgetById(id: string) {}
 }
 
killedBy: BudgetController should delete a budget by ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The budget with ID: e571aacf-8ce3-4536-b501-9131e55e8937 cannot be found"

Received function did not throw

[Killed] MethodExpression
src/budget/budget.service.ts:51:24
 
   deleteBudgetById(id: string) {
     const budgetToDelete = this.findBudgetById(id);
-    const newBudgets = this.budgets.filter(
-      (budget) => budget.id !== budgetToDelete.id,
-    );
+    const newBudgets = this.budgets;
     this.budgets = newBudgets;
   }
killedBy: BudgetController should delete a budget by ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The budget with ID: dd752377-27a8-4622-9d83-8f16492c7638 cannot be found"

Received function did not throw

[Killed] EqualityOperator
src/budget/budget.service.ts:52:19
   deleteBudgetById(id: string) {
     const budgetToDelete = this.findBudgetById(id);
     const newBudgets = this.budgets.filter(
-      (budget) => budget.id !== budgetToDelete.id,
+      (budget) => budget.id === budgetToDelete.id,
     );
     this.budgets = newBudgets;
killedBy: BudgetController should delete a budget by ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The budget with ID: 9300448d-d7fb-4c46-a2f8-763d75f7ad8e cannot be found"

Received function did not throw

[Killed] ConditionalExpression
src/budget/budget.service.ts:52:19
   deleteBudgetById(id: string) {
     const budgetToDelete = this.findBudgetById(id);
     const newBudgets = this.budgets.filter(
-      (budget) => budget.id !== budgetToDelete.id,
+      (budget) => true,
     );
     this.budgets = newBudgets;
killedBy: BudgetController should delete a budget by ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The budget with ID: 4e8e0ec0-0f68-43bc-b09e-7696fafd224e cannot be found"

Received function did not throw
